Revit 2027 API
RevisionNumberingSequence.GetAllRevisionNumberingSequences Method
 Gets all of the revision numbering sequences from the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetAllRevisionNumberingSequences(
	Document document
)
Public Shared Function GetAllRevisionNumberingSequences (
	document As Document
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetAllRevisionNumberingSequences(
	Document^ document
)
static member GetAllRevisionNumberingSequences :
        document : Document -> ISet<ElementId>
Parameters
document Document
 The document that contains the sequences.
Return Value
ISet<ElementId>
 The revision numbering sequences from the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace